Documents/НБКИДокументКорректировкаRUTDF.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>НБКИДокументКорректировкаRUTDF</Name>
			<BasedOn>
				<xr:Item>Document.НБКИДокументКорректировкаRUTDF</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиВыгрузкиНБКИ_RUTDF</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НепринятыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НБКИДокументКорректировкаRUTDF</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьФайлаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФайлаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принято</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтчетаНБКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКорректировкаРанееОтправленогоДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементФайлы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АрхивНБКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФайлаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>тчКорректировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияКорректировкиКИRUTDF</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьКИ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЧастиКИДляКорректировкиRUTDF</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КредитныеИсторииСобытияИсключенияАннулированияКорректировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийИсправленияИУдаленияRUTDF</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНаКорректировку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КредитныеИсторииДействияКорректировкиКИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КредитныеИсторииДействияКорректировкиКИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияКорректировкиКИRUTDF</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьКИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЧастиКИДляКорректировкиRUTDF</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеКорректировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеИсторииСобытияИсключенияАннулированияКорректировки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОперацияКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИсправленияИУдаленияRUTDF</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОтчетаНБКИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыОтчетаНБКИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетКорректировки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВерсияRUTDF.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВерсияRUTDF</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>v3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>v4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>v5</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКонтрагента</Name>
					<Comment>Уникальный код контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзывПерсональныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_ПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Действующее</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Реестр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеОБанкротстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТелефона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретЗвонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГорода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавочный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФИО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НБКИДокументКорректировкаRUTDF/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьОтчетНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ТекстСообщенияФормирования = "";
	ТекстовыйДокумент = ДокОбъект.СформироватьФайлыКорректировкиRUTDF(ТекстСообщенияФормирования);
	Сообщить(ТекстСообщенияФормирования);  
	Возврат ТекстовыйДокумент;	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Сначала сохраните документ!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.НастройкаВыгрузки) И ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		КаталогФайловВыгрузки = КаталогВыгрузкиВызовСервер();
		Путь = КаталогФайловВыгрузки + "\" + Объект.ИмяФайла;		
		ТекстовыйДок = СформироватьОтчетНаСервере();  
		Попытка
			ТекстовыйДок.Записать(Путь, КодировкаТекста.ANSI, ,Ложь); 
			ТекстСообщения = "Выгрузка завершена!" + Символы.ПС + ТекстСообщения;
		Исключение    
			ТекстСообщения = "Произошла ошибка сохранения файла в папку!" + Символы.ПС + ТекстСообщения;
		КонецПопытки;
		
	Иначе  
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбрана настройка для формирования отчета!";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Функция КаталогВыгрузкиВызовСервер()
	Возврат Объект.НастройкаВыгрузки.КаталогДляВыгрузки;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Дата = ТекущаяДата(); 
		Объект.Принято = Перечисления.СтатусыОтчетаНБКИ.ВОбработке;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаВыгрузкиПриИзмененииНаСервере()
	ИмяПользователя = Объект.НастройкаВыгрузки.ИмяПользователяНБКИ;
	Объект.ИмяФайла = Строка(ИмяПользователя) + "_" + КредитныеИстории.СформироватьСтрокуДаты(Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыгрузкиПриИзменении(Элемент)
	НастройкаВыгрузкиПриИзмененииНаСервере();
	ПроверкаВерсии();
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтказНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ОбработатьRejectФайл();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтказ(Команда)
	ОбработатьОтказНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьФайлаОтказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Заголовок = "Выберите файл REJET";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ИмяФайлаОтказа = ДиалогВыбора.ПолноеИмяФайла;
		Объект.ПутьФайлаОтказа = ИмяФайлаОтказа;
		Текст = Новый ЧтениеТекста(ИмяФайлаОтказа);	
		Объект.ТекстФайлаОтказа  =  Текст.Прочитать(); 	
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	ЗапретитьФормироватьОтчетПовторно();
	УправлениеПодписью();
	ДоступностьЭЦП();
	
КонецПроцедуры


&НаСервере
Процедура УправлениеВидимостью()
	
	Если Объект.Проведен Тогда
		Элементы.ГруппаКорректировкаКИ.ТолькоПросмотр = Истина;
		
		Элементы.Подбор.Доступность = Ложь;
		Элементы.ПодборИзФайла.Доступность = Ложь;
		Элементы.ПодборПоНастройкам.Доступность = Ложь; 
		
		Элементы.ЗаполнитьДействияИСобытияКорректировки.Доступность = Ложь;

	КонецЕсли;  
	
	Если Объект.Принято = Перечисления.СтатусыОтчетаНБКИ.НеПринято Тогда
		Элементы.ГруппаКорректировкаКИ.ТолькоПросмотр = Истина;
		
		Элементы.Подбор.Доступность = Ложь;
		Элементы.ПодборИзФайла.Доступность = Ложь;
		Элементы.ПодборПоНастройкам.Доступность = Ложь; 
		
		Элементы.ЗаполнитьДействияИСобытияКорректировки.Доступность = Ложь;  
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ТекстФайлаОтказа;
		Элементы.REJECT.ТолькоПросмотр = Ложь;  
		Элементы.ОбработатьОтказ.Доступность = Истина;
	Иначе  
		Элементы.REJECT.ТолькоПросмотр = Истина; 
		Элементы.ОбработатьОтказ.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.НепринятыйДокумент.ТолькоПросмотр = НЕ Объект.ЭтоКорректировкаРанееОтправленогоДокумента;
		
	
КонецПроцедуры  
  

&НаСервере
Процедура ПроверкаВерсии()
	
	Если Объект.НастройкаВыгрузки.ВерсияRUTDF = Перечисления.ВерсияRUTDF.v3 ИЛИ Объект.НастройкаВыгрузки.ВерсияRUTDF = Перечисления.ВерсияRUTDF.v4 Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данные операции не совместимы с текущей версией RUTDF. Необходимо выбрать настройку с версией 5.0";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПринятоПриИзменении(Элемент)
	УправлениеВидимостью(); 
	//ПроставитьЗаписямСтатус();
КонецПроцедуры 

&НаСервере
Процедура ПроставитьЗаписямСтатус()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПроставитьЗаписямСтатус();			
КонецПроцедуры  


&НаКлиенте
Процедура ЭтоКорректировкаРанееОтправленогоДокументаПриИзменении(Элемент)
	УправлениеВидимостью();
	Если НЕ Объект.ЭтоКорректировкаРанееОтправленогоДокумента Тогда
		ОчиститьНепринятыйДокумент();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНепринятыйДокумент()
	Объект.НепринятыйДокумент = "";
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	Объект.Объекты.Очистить();
	ОбъектыКлиент.Подбор(ЭтаФорма);
	ПодключитьОбработчикОжидания("ОбработатьРезультатПодбора", 1, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	Объект.Объекты.Очистить();
	ФормаПодбор = ПолучитьФорму("Обработка.ПодборДО.Форма.Форма",, ЭтаФорма); 
	ФормаПодбор.Объект.ТипИсточника = Неопределено;
	ОткрытьФорму(ФормаПодбор); 
	ПодключитьОбработчикОжидания("ОбработатьРезультатПодбора", 1, Ложь);
КонецПроцедуры   

&НаСервере
Процедура ОбработатьРезультатПодбораСервер(КоличествоОбъектов) 
	
	РабочаяТЧ = Объект.тчКорректировка; 	
	РабочаяТЧ.Очистить();
	Для каждого стр из Объект.Объекты Цикл
		Нстр =  РабочаяТЧ.Добавить();
		Нстр.ОбъектУчета = Стр.Объект;
		Попытка
			Нстр.Должник = Стр.Объект.Должник;
		Исключение
			Нстр.Должник = Справочники.Контрагенты.ПустаяСсылка();
		КонецПопытки;	
	КонецЦикла;
	
	КоличествоОбъектов = РабочаяТЧ.Количество();	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьРезультатПодбора() Экспорт
	КоличествоОбъектов = 0;
	ОбработатьРезультатПодбораСервер(КоличествоОбъектов);
	Если КоличествоОбъектов > 0 Тогда
		ОтключитьОбработчикОжидания("ОбработатьРезультатПодбора");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриАктивизацииСтроки(Элемент)
	ОбработатьРезультатПодбора();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриИзменении(Элемент)
	ОбработатьРезультатПодбора();
КонецПроцедуры


&НаКлиенте
Процедура ЭтоИсправлениеВсейКредитнойИнформацииПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры


&НаКлиенте
Процедура ПодборИзФайла(Команда)
	Объект.Объекты.Очистить();
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
	ПодключитьОбработчикОжидания("ОбработатьРезультатПодбора", 1, Ложь);
КонецПроцедуры    


&НаСервере
Процедура ЗаполнитьДействияИСобытияКорректировкиНаСервере(СтруктураИзРегистра)
	Для Каждого Стр из объект.тчКорректировка Цикл   
		ЗаполнитьЗначенияСвойств(Стр, СтруктураИзРегистра);
		Стр.Событие = СтруктураИзРегистра.СобытиеКорректировки;
		Стр.Операция = СтруктураИзРегистра.ОперацияКорректировки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействияИСобытияКорректировки(Команда)
	Если Элементы.тчКорректировка.ТекущаяСтрока = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо выбрать хотя бы один объект на корректировку!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ВладелецФормыПодбора = Этаформа;
	ОткрытьФорму("РегистрСведений.КредитныеИсторииДействияКорректировкиКИ.Форма.ФормаСписка", ПараметрыОткрытия, ВладелецФормыПодбора);
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьДействияИСобытияКорректировкиНаСервере(ВыбранноеЗначение); 
КонецПроцедуры 

&НаСервере
Процедура тчКорректировкаОбъектУчетаПриИзмененииНаСервере(НомерСтроки, ТекОбъектУчета)
	Если ТипЗнч(ТекОбъектУчета) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Объект.тчКорректировка[НомерСтроки - 1].Должник = ТекОбъектУчета.Должник;
	ИначеЕсли ТипЗнч(ТекОбъектУчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.тчКорректировка[НомерСтроки - 1].Должник = ТекОбъектУчета;		
	Иначе
		Возврат;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура тчКорректировкаОбъектУчетаПриИзменении(Элемент)
	тчКорректировкаОбъектУчетаПриИзмененииНаСервере(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.НомерСтроки, ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектУчета);
КонецПроцедуры




#Область ЭЦП

&НаКлиенте
Процедура ДоступностьЭЦП()

	ВидимостьЭлементовЭЦП(Ложь);
	Если УправлениеДоступами.ЕстьДоступЭЦП() Тогда
	
		ВидимостьЭлементовЭЦП(Истина)
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовЭЦП(ЗначениеВидимости)

	Элементы.Подпись.Видимость = ЗначениеВидимости;
	Элементы.Архив.Видимость = ЗначениеВидимости;
	
	Элементы.ЭлементФайлы.Видимость = ЗначениеВидимости;
	Элементы.АрхивНБКИ.Видимость = ЗначениеВидимости;

КонецПроцедуры

&НаКлиенте
Процедура Прикрепить(Команда)

	Попытка
	
		ФайлКлиента = УправлениеФайловаяСистема.НайтиФайл(Объект.ИмяФайла, КаталогВыгрузкиВызовСервер());
	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", "ЭлементФайлы");
	ДополнительныеПараметры.Вставить("КонтрольФормы", Истина);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПомещения", ЭтаФорма, ДополнительныеПараметры);
	
	АдресХранилища = "";
	НачатьПомещениеФайлаНаСервер(
		ОповещениеОЗавершении,
		,,
		АдресХранилища,
		ФайлКлиента.ПолноеИмя,
		ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещения(ПомещенныйФайл, ПараметрыПомещения) Экспорт

	Если НЕ ЭтоАдресВременногоХранилища(ПомещенныйФайл.Адрес) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось поместить файл";
		Сообщение.Сообщить();
		Возврат;
	
	КонецЕсли;

	ДанныеДляПомещения = Новый Структура;
	ДанныеДляПомещения.Вставить("АдресХранилища", ПомещенныйФайл.Адрес);
	ДанныеДляПомещения.Вставить("ИмяБезРасширения", ПомещенныйФайл.СсылкаНаФайл.Файл.ИмяБезРасширения);
	ДанныеДляПомещения.Вставить("Расширение", ПомещенныйФайл.СсылкаНаФайл.Расширение);
	
	Попытка
	
		ЭлементыСправочникаФайлы = ПолучитьСправочникФайл(ДанныеДляПомещения);
		Если ЭлементыСправочникаФайлы.Количество() = 1 Тогда
		
			УстановитьСсылкуНаСправочникФайлы(ЭлементыСправочникаФайлы, ПараметрыПомещения);
		
		КонецЕсли;
	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прикрепить файл: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ЗанестиВБазу = Ложь;
	Если ПараметрыПомещения.Свойство("Архив", ЗанестиВБазу)
		И ЗанестиВБазу Тогда
		
		ЗашифроватьФайл(Объект.АрхивНБКИ, Истина);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСсылкуНаСправочникФайлы(ЭлементыСправочникаФайлы, ПараметрыПомещения);

	Объект[ПараметрыПомещения["Ссылка"]] = ЭлементыСправочникаФайлы[0];
	
	Если ПараметрыПомещения["КонтрольФормы"] Тогда
	
		ЗапретитьФормироватьОтчетПовторно();
		УправлениеПодписью();
	
	КонецЕсли;

	
	//Объект.ЭлементФайлы = ЭлементыСправочникаФайлы[0];
	//ЗапретитьФормироватьОтчетПовторно();
	//УправлениеПодписью();

КонецПроцедуры


&НаКлиенте
Процедура ЗапретитьФормироватьОтчетПовторно()

	Если ЗначениеЗаполнено(Объект.ЭлементФайлы) Тогда
	
		Элементы.ФормаСформироватьОтчет.Доступность = Ложь;
		Элементы.ФормаПрикрепить.Доступность = Ложь;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеПодписью()

	Элементы.ФормаГруппаПодписание.Доступность = Ложь;
	Если ЗначениеЗаполнено(Объект.ЭлементФайлы) Тогда
	
		Элементы.ФормаГруппаПодписание.Доступность = Истина;
		Элементы.ФормаПрикрепить.Доступность = Ложь;
	
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ПолучитьСправочникФайл(ДанныеДляПомещения)

	ДанныеДляПомещения.Вставить("ПапкаВладелец", Справочники.ПапкиФайлов.НБКИ);
	ЭлементыСправочникаФайлы = Обработки.Интерфейс_Файлы.ПолучитьФайлы(ДанныеДляПомещения);
	
	Возврат ЭлементыСправочникаФайлы;

КонецФункции // ()


&НаКлиенте
Процедура Подписать(Команда)

	РаботаСФайламиКлиент.ПодписатьФайл(Объект.ЭлементФайлы, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура Зашифровать(Команда)

	ЗашифроватьФайл(Объект.ЭлементФайлы);
	//ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайлаИКоличествоВерсий(Объект.ЭлементФайлы);
	//
	//ПараметрыОбработчика = Новый Структура;
	//ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	//ПараметрыОбработчика.Вставить("ОбъектСсылка", Объект.ЭлементФайлы);
	//
	//Обработчик = Новый ОписаниеОповещения("ПослеШифрования", ЭтаФорма, ПараметрыОбработчика);
	//
	//РаботаСФайламиСлужебныйКлиент.Зашифровать(Обработчик, ДанныеФайла, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеШифрования(Результат, ПараметрыШифрования) Экспорт

	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРабочегоКаталога = РаботаСФайламиСлужебныйКлиент.РабочийКаталогПользователя();
	
	МассивФайловВРабочемКаталогеДляУдаления = Новый Массив;
	
	ЗашифроватьСервер(
		Результат.МассивДанныхДляЗанесенияВБазу,
		Результат.МассивОтпечатков,
		МассивФайловВРабочемКаталогеДляУдаления,
		ИмяРабочегоКаталога,
		ПараметрыШифрования.ОбъектСсылка);
	
	РаботаСФайламиСлужебныйКлиент.ИнформироватьОШифровании(
		МассивФайловВРабочемКаталогеДляУдаления,
		ПараметрыШифрования.ДанныеФайла.Владелец,
		ПараметрыШифрования.ОбъектСсылка);

	Если ПараметрыШифрования["Архив"] Тогда
	
		РаботаСФайламиСлужебныйКлиент.СохранитьФайлВместеСПодписью(
			Объект.АрхивНБКИ,
			УникальныйИдентификатор);
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗашифроватьСервер(МассивДанныхДляЗанесенияВБазу, МассивОтпечатков, 
	МассивФайловВРабочемКаталогеДляУдаления,
	ИмяРабочегоКаталога, ОбъектСсылка)
	
	Зашифровать = Истина;
	РаботаСФайламиСлужебный.ЗаписатьИнформациюОШифровании(
		ОбъектСсылка,
		Зашифровать,
		МассивДанныхДляЗанесенияВБазу,
		Неопределено,  // УникальныйИдентификатор
		ИмяРабочегоКаталога,
		МассивФайловВРабочемКаталогеДляУдаления,
		МассивОтпечатков);
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)

	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайлаИКоличествоВерсий(Объект.ЭлементФайлы);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	ПараметрыОбработчика.Вставить("ОбъектСсылка", Объект.ЭлементФайлы);
	Обработчик = Новый ОписаниеОповещения("ПослеРасшифровки", ЭтотОбъект, ПараметрыОбработчика);
	
	РаботаСФайламиСлужебныйКлиент.Расшифровать(
		Обработчик,
		ДанныеФайла.Ссылка,
		УникальныйИдентификатор,
		ДанныеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРасшифровки(Результат, ПараметрыВыполнения) Экспорт
	
	Если Результат = Ложь Или Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРабочегоКаталога = РаботаСФайламиСлужебныйКлиент.РабочийКаталогПользователя();
	
	РасшифроватьСервер(
		Результат.МассивДанныхДляЗанесенияВБазу,
		ИмяРабочегоКаталога,
		ПараметрыВыполнения.ОбъектСсылка);
	
	РаботаСФайламиСлужебныйКлиент.ИнформироватьОРасшифровке(
		ПараметрыВыполнения.ДанныеФайла.Владелец,
		ПараметрыВыполнения.ОбъектСсылка);

КонецПроцедуры

&НаСервере
Процедура РасшифроватьСервер(МассивДанныхДляЗанесенияВБазу, 
	ИмяРабочегоКаталога, ОбъектСсылка)
	
	Зашифровать = Ложь;
	МассивОтпечатков = Новый Массив;
	МассивФайловВРабочемКаталогеДляУдаления = Новый Массив;
	
	РаботаСФайламиСлужебный.ЗаписатьИнформациюОШифровании(
		ОбъектСсылка,
		Зашифровать,
		МассивДанныхДляЗанесенияВБазу,
		Неопределено,  // УникальныйИдентификатор
		ИмяРабочегоКаталога,
		МассивФайловВРабочемКаталогеДляУдаления,
		МассивОтпечатков);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВместеСПодписью(Команда)
	
	РаботаСФайламиСлужебныйКлиент.СохранитьФайлВместеСПодписью(
		Объект.ЭлементФайлы,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьВАрхив(Команда)

	АдресАрхива = АрхивироватьНБКИФайлы();
	Если НЕ ЗначениеЗаполнено(АдресАрхива) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ЗанестиАрхивВБазу(АдресАрхива);

КонецПроцедуры

&НаКлиенте
Функция АрхивироватьНБКИФайлы()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберете отчет и подпись";
	Диалог.Фильтр = "Все файлы (*.*)|*.*";
	Диалог.МножественныйВыбор = Истина;
	
	Если НЕ Диалог.Выбрать() Тогда
	
		Возврат "";
	
	КонецЕсли;
	
	ВыбранныеФайлы = Диалог.ВыбранныеФайлы;
	Если ВыбранныеФайлы.Количество() = 0 Тогда
	
		Возврат ""
	
	КонецЕсли;
	
	ПервыйФайл = ВыбранныеФайлы[0];
	ФайлПервыйФайл = Новый Файл(ПервыйФайл);
	Каталог = ФайлПервыйФайл.Путь;
	АдресАрхива = Каталог + ПолучитьРазделительПутиКлиента() + Объект.ИмяФайла + ".zip";
	
	НовыйАрхив = Новый ЗаписьZipФайла(
		АдресАрхива,
		"",
		,
		МетодСжатияZIP.Сжатие,
		УровеньСжатияZIP.Оптимальный);
	
	Для каждого ВыбранныйФайл Из ВыбранныеФайлы Цикл
	
		НовыйАрхив.Добавить(ВыбранныйФайл);
	
	КонецЦикла;
	
	НовыйАрхив.Записать();
	
	Возврат АдресАрхива;

КонецФункции // ()

&НаКлиенте
Функция ЗанестиАрхивВБазу(АдресАрхива)

	Архив = Новый Файл(АдресАрхива);
	
	Попытка
	
		ФайлКлиента = УправлениеФайловаяСистема.НайтиФайл(Архив.Имя, Архив.Путь);
	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецПопытки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", "АрхивНБКИ");
	ДополнительныеПараметры.Вставить("КонтрольФормы", Ложь);
	ДополнительныеПараметры.Вставить("Архив", Истина);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПомещения", ЭтаФорма, ДополнительныеПараметры);
	
	АдресХранилища = "";

	НачатьПомещениеФайлаНаСервер(
		ОповещениеОЗавершении,
		,,
		АдресХранилища,
		ФайлКлиента.ПолноеИмя,
		ЭтаФорма.УникальныйИдентификатор);

	Возврат Истина;

КонецФункции // ()

&НаКлиенте
Процедура ЗашифроватьФайл(СсылкаНаФайл, Архив = Ложь)

	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайлаИКоличествоВерсий(СсылкаНаФайл);
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
	ПараметрыОбработчика.Вставить("ОбъектСсылка", СсылкаНаФайл);
	ПараметрыОбработчика.Вставить("Архив", Архив);
	
	Обработчик = Новый ОписаниеОповещения("ПослеШифрования", ЭтаФорма, ПараметрыОбработчика);
	
	РаботаСФайламиСлужебныйКлиент.Зашифровать(Обработчик, ДанныеФайла, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
